import classNames from 'classnames/bind'

import { Button } from '@/shared/ui/button'

import QuestionDetailCard from '../question-detail-card'
import styles from './styles.module.scss'

const cx = classNames.bind(styles)

const QuestionContainer = () => {
  // 임시
  const hasAnswer = true

  return (
    <>
      <div className={cx('container')}>
        <QuestionDetailCard
          isAuthor={true}
          strategyName="ETF 레버리지 /인버"
          title="미국발 경제악화가 한국 증시에 미치는 영향은 무엇인가요?"
          contents="안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구..........안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.......... 안녕하세요 주식투자를 해보려고 하는데요 어쩌구... 저쩌구.........."
          nickname="홍길동"
          createdAt="2024-11-03T15:00:00"
          status="답변 완료"
        />
        {hasAnswer ? (
          <QuestionDetailCard
            type="answer"
            isAuthor={false}
            contents="저는 이러쿵저러쿵 생각합니다... 저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다... 저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다... 저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다... 저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다... 저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다... 저는 이러쿵저러쿵 생각합니다...저는 이러쿵저러쿵 생각합니다..."
            nickname="전문가"
            createdAt="2024-11-03T15:00:00"
          />
        ) : (
          <p className={cx('empty-message')}>아직 답변이 없습니다</p>
        )}

        <Button variant="filled" className={cx('button')}>
          추가 질문하기
        </Button>
      </div>
    </>
  )
}

export default QuestionContainer
